config/emacs.d/config.org
#+TITLE: Emacs Init File! 
#+STARTUP: hideblocks 
* Intro
This is my emacs init file. =init.el= loads the elisp code from here. It's
pretty cool that I can write it in org mode, because easy organization and
rearrangement are pretty sweet. Check out [[https://github.com/aaronbieber/][@aaronbieber]] and [[https://github.com/hrs][@hrs]], a lot of the
inspiration (and erm, code) for this is taken from them.
* Personal Info

#+BEGIN_SRC emacs-lisp
  (setq user-full-name "Diego A. Mundo"
        user-mail-address "diegoamundo@gmail.com"
        calendar-location-name "Cambridge, MA")

#+END_SRC

* Package Managing
Setup up cool stuff like use-package, and stuff.

** Misc init

#+BEGIN_SRC emacs-lisp
  (require 'package)
  (setq package-enable-at-startup nil)
  (add-to-list 'load-path
               (expand-file-name "lisp" user-emacs-directory))

  ;; Add directories in "lisp" folder
  (let ((files (directory-files-and-attributes "~/.emacs.d/lisp" t)))
    (dolist (file files)
      (let ((filename (car file))
            (dir (nth 1 file)))
        (when (and dir
                   (not (string-suffix-p "." filename)))
          (add-to-list 'load-path (car file))))))

  (add-to-list 'exec-path "/usr/local/bin")
#+END_SRC

** Init utils

#+BEGIN_SRC emacs-lisp
  ;;; init-utils.el --- Utilities borrowed from Steve Purcell
  ;;; Commentary:
  ;;; Code:
  (if (fboundp 'with-eval-after-load)
      (defalias 'after-load 'with-eval-after-load)
    (defmacro after-load (feature &rest body)
      "After FEATURE is loaded, evaluate BODY."
      (declare (indent defun))
      `(eval-after-load ,feature
         '(progn ,@body))))


  ;;----------------------------------------------------------------------------
  ;; Handier way to add modes to auto-mode-alist
  ;;----------------------------------------------------------------------------
  (defun add-auto-mode (mode &rest patterns)
    "Add entries to `auto-mode-alist' to use `MODE' for all given file `PATTERNS'."
    (dolist (pattern patterns)
      (add-to-list 'auto-mode-alist (cons pattern mode))))


  ;;----------------------------------------------------------------------------
  ;; String utilities missing from core emacs
  ;;----------------------------------------------------------------------------
  (defun sanityinc/string-all-matches (regex str &optional group)
    "Find all matches for `REGEX' within `STR', returning the full match string or group `GROUP'."
    (let ((result nil)
          (pos 0)
          (group (or group 0)))
      (while (string-match regex str pos)
        (push (match-string group str) result)
        (setq pos (match-end group)))
      result))

  (defun sanityinc/string-rtrim (str)
    "Remove trailing whitespace from `STR'."
    (replace-regexp-in-string "[ \t\n]+$" "" str))


  ;;----------------------------------------------------------------------------
  ;; Find the directory containing a given library
  ;;----------------------------------------------------------------------------
  (autoload 'find-library-name "find-func")
  (defun sanityinc/directory-of-library (library-name)
    "Return the directory in which the `LIBRARY-NAME' load file is found."
    (file-name-as-directory (file-name-directory (find-library-name library-name))))


  ;;----------------------------------------------------------------------------
  ;; Delete the current file
  ;;----------------------------------------------------------------------------
  (defun delete-this-file ()
    "Delete the current file, and kill the buffer."
    (interactive)
    (or (buffer-file-name) (error "No file is currently being edited"))
    (when (yes-or-no-p (format "Really delete '%s'?"
                               (file-name-nondirectory buffer-file-name)))
      (delete-file (buffer-file-name))
      (kill-this-buffer)))


  ;;----------------------------------------------------------------------------
  ;; Rename the current file
  ;;----------------------------------------------------------------------------
  (defun rename-this-file-and-buffer (new-name)
    "Renames both current buffer and file it's visiting to NEW-NAME."
    (interactive "sNew name: ")
    (let ((name (buffer-name))
          (filename (buffer-file-name)))
      (unless filename
        (error "Buffer '%s' is not visiting a file!" name))
      (if (get-buffer new-name)
          (message "A buffer named '%s' already exists!" new-name)
        (progn
          (when (file-exists-p filename)
           (rename-file filename new-name 1))
          (rename-buffer new-name)
          (set-visited-file-name new-name)))))

  ;;----------------------------------------------------------------------------
  ;; Browse current HTML file
  ;;----------------------------------------------------------------------------
  (defun browse-current-file ()
    "Open the current file as a URL using `browse-url'."
    (interactive)
    (let ((file-name (buffer-file-name)))
      (if (tramp-tramp-file-p file-name)
          (error "Cannot open tramp file")
        (browse-url (concat "file://" file-name)))))


  ;;; init-utils.el ends here

#+END_SRC

** Package setup

#+BEGIN_SRC emacs-lisp
  ;;; Find and load the correct package.el

  ;; When switching between Emacs 23 and 24, we always use the bundled package.el in Emacs 24
  (let ((package-el-site-lisp-dir
         (expand-file-name "site-lisp/package" user-emacs-directory)))
    (when (and (file-directory-p package-el-site-lisp-dir)
               (> emacs-major-version 23))
      (message "Removing local package.el from load-path to avoid shadowing bundled version")
      (setq load-path (remove package-el-site-lisp-dir load-path))))

  (require 'package)


  ;;; Standard package repositories
  (add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/"))
  (add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/"))
  (add-to-list 'package-archives '("melpa-stable" . "http://stable.melpa.org/packages/"))
  (add-to-list 'package-archives '("marmalade" . "http://marmalade-repo.org/packages/"))
  (add-to-list 'package-archives '("elpy" . "https://jorgenschaefer.github.io/packages/"))

  ;;; Pin some packages to specific repositories.
  (setq package-pinned-packages '((gtags . "marmalade")))

  ;; If gpg cannot be found, signature checking will fail, so we
  ;; conditionally enable it according to whether gpg is available. We
  ;; re-run this check once $PATH has been configured
  (defun sanityinc/package-maybe-enable-signatures ()
    (setq package-check-signature (when (executable-find "gpg") 'allow-unsigned)))

  (sanityinc/package-maybe-enable-signatures)
  (after-load 'init-exec-path
              (sanityinc/package-maybe-enable-signatures))


  ;;; On-demand installation of packages
  (defun require-package (package &optional min-version no-refresh)
      "Install given PACKAGE, optionally requiring MIN-VERSION.
  If NO-REFRESH is non-nil, the available package lists will not be
  re-downloaded in order to locate PACKAGE."
      (if (package-installed-p package min-version)
          t
        (if (or (assoc package package-archive-contents) no-refresh)
            (package-install package)
          (progn
            (package-refresh-contents)
            (require-package package min-version t)))))

  (defun maybe-require-package (package &optional min-version no-refresh)
      "Try to install PACKAGE, and return non-nil if successful.
  In the event of failure, return nil and print a warning message.
  Optionally require MIN-VERSION.  If NO-REFRESH is non-nil, the
  available package lists will not be re-downloaded in order to
  locate PACKAGE."
      (condition-case err
          (require-package package min-version no-refresh)
        (error
         (message "Couldn't install package `%s': %S" package err)
         nil)))


  ;;; Fire up package.el
  (setq package-enable-at-startup nil)
  (package-initialize)

  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  (eval-when-compile
      (require 'use-package))
#+END_SRC

* Global settings and stuff

#+BEGIN_SRC emacs-lisp
  (setq inhibit-splash-screen t
        inhibit-startup-message t
        inhibit-startup-echo-area-message t)
  (menu-bar-mode 0)
  (tool-bar-mode -1)
  (toggle-scroll-bar -1)
  (show-paren-mode 1)
  (electric-pair-mode)
  (add-hook 'minibuffer-setup-hook (lambda ()
                                     (electric-pair-mode)))
  (setq display-time-load-average nil)
  (setq cursor-type 'bar)
  (fringe-mode 0)
  (add-to-list 'default-frame-alist '(font . "Menlo-10"))
  (setq scroll-conservatively 10000)
  (setq-default tab-width 4)
  (setq tab-stop-list (number-sequence 4 200 4))
  (setq completion-cycle-threshold t)

  ; Store backups in .emacsbackups, autosaves in temp dir
  (defvar backup-dir "~/.emacsbackups/")
  (setq backup-directory-alist (list (cons "." backup-dir)))
  (setq auto-save-file-name-transforms
        `((".*" ,temporary-file-directory t)))

  ;;; Custom Key Bindings ;;;
  ;; (global-set-key (kbd "<f8> <f1>")
  ;;              '(lambda () (interactive) (ansi-term "/usr/local/bin/ipython")))
  ;; (global-set-key (kbd "<f8> <f2>")
  ;;              '(lambda () (interactive) (ansi-term "/Users/diego/.virtualenvs/py2/bin/ipython")))
  ;; (global-set-key (kbd "<f9>") 'linum-mode)
  ;; (global-set-key (kbd "M-RET") 'python-shell-send-buffer)

  ;; Global stuff
  (global-hl-line-mode 1)
  ;; (global-linum-mode 1)
  (setq linum-delay t)
  (global-auto-revert-mode t)
  (setq whitespace-style '(face trailing))
  (setq column-number-mode t)
#+END_SRC 

* Major configs
...thanks, [[https://github.com/aaronbieber/][@aaronbieber]]. Seriously, go check him out. I
like the way he does stuff. This is mostly (entirely?) his code.

** Global functions
#+BEGIN_SRC emacs-lisp
  (defun air--pop-to-file (file &optional split)
    "Visit a FILE, either in the current window or a SPLIT."
    (if split
        (find-file-other-window file)
      (find-file file)))

  (defun occur-last-search ()
     "Run `occur` with the last evil search term."
     (interactive)
     ;; Use the appropriate search term based on regexp setting.
     (let ((term (if evil-regexp-search
                     (car-safe regexp-search-ring)
                   (car-safe search-ring))))
       ;; If a search term exists, execute `occur` on it.
       (if (> (length term) 0)
           (occur term)
         (message "No term to search for."))))

  (defun show-first-occurrence ()
    "Display the location of the word at point's first occurrence in the buffer."
    (interactive)
    (save-excursion
      (let ((search-word (thing-at-point 'symbol t)))
        (goto-char 1)
        (re-search-forward search-word)
        (message (concat
                  "L" (number-to-string (line-number-at-pos)) ": "
                  (replace-regexp-in-string
                   "[ \t\n]*\\'"
                   ""
                   (thing-at-point 'line t)
                   ))))))

  (defun switch-to-previous-buffer ()
      "Switch to previously open buffer.
  Repeated invocations toggle between the two most recently open buffers."
      (interactive)
        (switch-to-buffer (other-buffer (current-buffer) 1)))

  ;;; Helpers for narrowing.
  (defun narrow-and-set-normal ()
    "Narrow to the region and, if in a visual mode, set normal mode."
    (interactive)
    (narrow-to-region (region-beginning) (region-end))
    (if (string= evil-state "visual")
        (progn (evil-normal-state nil)
               (evil-goto-first-line))))

  (defun narrow-to-region-or-subtree ()
    "Narrow to a region, if set, otherwise to an Org subtree, if present."
    (interactive)
    (if (and mark-active
             (not (= (region-beginning) (region-end))))
        (narrow-and-set-normal)
      (if (derived-mode-p 'org-mode)
          (org-narrow-to-subtree))))

  (defun air-narrow-dwim ()
      "Narrow to a thing or widen based on context.
  Attempts to follow the Do What I Mean philosophy."
      (interactive)
      (if (buffer-narrowed-p)
          (widen)
        (narrow-to-region-or-subtree)))


  (defun toggle-window-split ()
    (interactive)
    (if (= (count-windows) 2)
        (let* ((this-win-buffer (window-buffer))
               (next-win-buffer (window-buffer (next-window)))
               (this-win-edges (window-edges (selected-window)))
               (next-win-edges (window-edges (next-window)))
               (this-win-2nd (not (and (<= (car this-win-edges)
                                           (car next-win-edges))
                                       (<= (cadr this-win-edges)
                                           (cadr next-win-edges)))))
               (splitter
                (if (= (car this-win-edges)
                       (car (window-edges (next-window))))
                    'split-window-horizontally
                  'split-window-vertically)))
          (delete-other-windows)
          (let ((first-win (selected-window)))
            (funcall splitter)
            (if this-win-2nd (other-window 1))
            (set-window-buffer (selected-window) this-win-buffer)
            (set-window-buffer (next-window) next-win-buffer)
            (select-window first-win)
            (if this-win-2nd (other-window 1))))))
#+END_SRC
** Evil mode
