config/emacs.d/config.el

(require 'package)
(setq package-enable-at-startup nil)
(add-to-list 'load-path
             (expand-file-name "lisp" user-emacs-directory))

;; Add directories in "lisp" folder
(let ((files (directory-files-and-attributes "~/.emacs.d/lisp" t)))
  (dolist (file files)
    (let ((filename (car file))
          (dir (nth 1 file)))
      (when (and dir
                 (not (string-suffix-p "." filename)))
        (add-to-list 'load-path (car file))))))

(add-to-list 'exec-path "/usr/local/bin")
(require 'init-utils)
(require 'init-elpa)

(package-initialize)

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(eval-when-compile
    (require 'use-package))

(setq user-full-name "Diego A. Mundo"
      user-mail-address "diegoamundo@gmail.com"
      calendar-location-name "Cambridge, MA")

(setq inhibit-splash-screen t
      inhibit-startup-message t
      inhibit-startup-echo-area-message t)
(menu-bar-mode 0)
(tool-bar-mode -1)
(toggle-scroll-bar -1)
(show-paren-mode 1)
(electric-pair-mode)
(add-hook 'minibuffer-setup-hook (lambda ()
                                   (electric-pair-mode)))
(setq display-time-load-average nil)
(setq cursor-type 'bar)
(fringe-mode 0)
(add-to-list 'default-frame-alist '(font . "Menlo-10"))
(setq scroll-conservatively 10000)
(setq-default tab-width 4)
(setq tab-stop-list (number-sequence 4 200 4))
(setq completion-cycle-threshold t)

; Store backups in .emacsbackups, autosaves in temp dir
(defvar backup-dir "~/.emacsbackups/")
(setq backup-directory-alist (list (cons "." backup-dir)))
(setq auto-save-file-name-transforms
      `((".*" ,temporary-file-directory t)))

;;; Custom Key Bindings ;;;
;; (global-set-key (kbd "<f8> <f1>")
;;              '(lambda () (interactive) (ansi-term "/usr/local/bin/ipython")))
;; (global-set-key (kbd "<f8> <f2>")
;;              '(lambda () (interactive) (ansi-term "/Users/diego/.virtualenvs/py2/bin/ipython")))
;; (global-set-key (kbd "<f9>") 'linum-mode)
;; (global-set-key (kbd "M-RET") 'python-shell-send-buffer)

;; Global stuff
(global-hl-line-mode 1)
;; (global-linum-mode 1)
(setq linum-delay t)
(global-auto-revert-mode t)
(setq whitespace-style '(face trailing))
(setq column-number-mode t)

(require 'init-global-functions)

(require 'init-evil)

;; Org prerequisites
