config/emacs.d/config.org
*** Setup
#+BEGIN_SRC emacs-lisp
  ;;; Code:
  (use-package org
    :ensure t
    :defer t
    :commands (org-capture)
    :bind (("C-c c" .   air-org-task-capture)
           ("C-c l" .   org-store-link)
           ("C-c t n" . air-pop-to-org-notes)
           ("C-c t t" . air-pop-to-org-todo)
           ("C-c t v" . air-pop-to-org-vault)
           ("C-c t a" . air-pop-to-org-agenda)
           ("C-c t A" . org-agenda)
           ("C-c f k" . org-search-view)
           ("C-c f t" . org-tags-view)
           ("C-c f i" . air-org-goto-custom-id))
    :config
    (setq org-agenda-text-search-extra-files '(agenda-archives))
    (setq org-agenda-files '("~/Dropbox (MIT)/org/"))
    (setq org-todo-keywords
          '((sequence "☛ TODO" "○ IN-PROGRESS" "⚑ WAITING" "|" "✓ DONE" "✗ CANCELED")))
    (setq org-blank-before-new-entry '((heading . t)
                                       (plain-list-item . t)))
    (setq org-capture-templates
          '(("a" "My TODO task format." entry
             (file "todo.org")
             "* ☛ TODO %?\nSCHEDULED: %t")
            ("n" "A (work-related) note." entry
             (file+headline "notes.org" "Work")
             "* %?\n%u\n\n"
             :jump-to-captured t)))
    (setq org-default-notes-file "~/Dropbox (MIT)/org/todo.org")
    (setq org-directory "~/Dropbox (MIT)/org")
    (setq org-enforce-todo-dependencies t)
    (setq org-log-done (quote time))
    (setq org-log-redeadline (quote time))
    (setq org-log-reschedule (quote time))
    (setq org-agenda-skip-scheduled-if-done t)
    (setq org-insert-heading-respect-content t)
    (setq org-ellipsis " …")
    (setq org-startup-with-inline-images t)
    (set-face-attribute 'org-upcoming-deadline nil :foreground "gold1")

    (evil-leader/set-key-for-mode 'org-mode
      "$"  'org-archive-subtree
      "a"  'org-agenda
      "c"  'air-org-set-category-property
      "d"  'org-deadline
      "ns" 'org-narrow-to-subtree
      "p"  'org-set-property
      "s"  'org-schedule
      "t"  'air-org-set-tags
      ",c" 'org-table-insert-column
      ",r" 'org-table-insert-row
      ",w" 'fill-paragraph)

    (add-hook 'org-agenda-mode-hook
              (lambda ()
                (setq org-habit-graph-column 50)
                (define-key org-agenda-mode-map "j"          'org-agenda-next-line)
                (define-key org-agenda-mode-map "k"          'org-agenda-previous-line)
                (define-key org-agenda-mode-map "n"          'org-agenda-next-date-line)
                (define-key org-agenda-mode-map "p"          'org-agenda-previous-date-line)
                (define-key org-agenda-mode-map "c"          'air-org-agenda-capture)
                (define-key org-agenda-mode-map "R"          'org-revert-all-org-buffers)
                (define-key org-agenda-mode-map (kbd "RET")  'org-agenda-switch-to)

                (define-prefix-command 'air-org-run-shortcuts)
                (define-key air-org-run-shortcuts "f" (tiny-menu-run-item "org-files"))
                (define-key air-org-run-shortcuts "t" (tiny-menu-run-item "org-things"))
                (define-key air-org-run-shortcuts "c" (tiny-menu-run-item "org-captures"))
                (define-key air-org-run-shortcuts "l" (tiny-menu-run-item "org-links"))
                (define-key org-agenda-mode-map (kbd "\\") air-org-run-shortcuts)))

    (add-hook 'org-capture-mode-hook
              (lambda ()
                (evil-define-key 'insert org-capture-mode-map (kbd "C-d") 'air-org-agenda-toggle-date)
                (evil-define-key 'normal org-capture-mode-map (kbd "C-d") 'air-org-agenda-toggle-date)
                (evil-insert-state)))

    (add-hook 'org-mode-hook
              (lambda ()
                ;; Special plain list leader inserts
                (dolist (char '("+" "-"))
                  (define-key org-mode-map (kbd char)
                    `(lambda ()
                       (interactive)
                       (air--org-insert-list-leader-or-self ,char))))

                ;; Normal maps
                (define-key org-mode-map (kbd "C-c d")   (lambda ()
                                                           (interactive) (air-org-agenda-toggle-date t)))
                (define-key org-mode-map (kbd "C-c ,")   'org-time-stamp-inactive)
                (define-key org-mode-map (kbd "C-|")     'air-org-insert-scheduled-heading)
                (define-key org-mode-map (kbd "C-\\")    'air-org-insert-heading)
                (define-key org-mode-map (kbd "C-<")     'org-metaleft)
                (define-key org-mode-map (kbd "C->")     'org-metaright)
                (define-key org-mode-map (kbd "S-r")     'org-revert-all-org-buffers)
                (define-key org-mode-map (kbd "C-c C-l") (tiny-menu-run-item "org-links"))

                (evil-define-key 'normal org-mode-map (kbd "TAB") 'org-cycle)
                (evil-define-key 'normal org-mode-map ">>"        'org-metaright)
                (evil-define-key 'normal org-mode-map "<<"        'org-metaleft)
                (evil-define-key 'normal org-mode-map (kbd "C-S-l") 'org-shiftright)
                (evil-define-key 'normal org-mode-map (kbd "C-S-h") 'org-shiftleft)
                (evil-define-key 'insert org-mode-map (kbd "C-S-l") 'org-shiftright)
                (evil-define-key 'insert org-mode-map (kbd "C-S-h") 'org-shiftleft)

                ;; Navigation
                (evil-define-key 'normal org-mode-map (kbd "]n") 'org-forward-heading-same-level)
                (evil-define-key 'normal org-mode-map (kbd "[n") 'org-backward-heading-same-level)
                (define-key org-mode-map (kbd "C-S-j") (lambda ()
                                                         (interactive)
                                                         (org-up-element)
                                                         (org-forward-heading-same-level 1)))
                (define-key org-mode-map (kbd "C-S-k") 'org-up-element)

                ;; Use fill column, but not in agenda
                (setq fill-column 79)
                ;; (when (not (eq major-mode 'org-agenda-mode))
                ;;   (visual-line-mode)
                ;;   (visual-fill-column-mode))
                ;; (flyspell-mode)
                (org-indent-mode))))

  (use-package org-bullets
    :ensure t
    :config
    (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
    (setq org-bullets-bullet-list '("•")))

  ;;; init-org.el ends here"]")))))
#+END_SRC
 
* Dem packages
** [[https://github.com/emacs-helm/helm][emacs-helm/helm]]
Kind of an Alfred for emacs. Completion, nice menus for stuff,
overall great.

#+BEGIN_SRC emacs-lisp
  (use-package helm
    :ensure t
    :init
    (require 'helm-config)
    :config
    (use-package helm-descbinds
      ;; To describe keys in a nicer way
      :ensure t)
    (use-package helm-projectile
      ;; To use with projectile
      :ensure t
      :config
      (projectile-global-mode))
    ;; (use-package helm-ag
    ;;    :ensure t)
    (helm-mode 1)
    (helm-autoresize-mode t)
    (global-set-key (kbd "M-x") 'helm-M-x)  
    (global-set-key (kbd "<f1>") 'helm-find-files)  
    (global-set-key (kbd "<f2>") 'helm-mini)
    (setq helm-completion-in-region-fuzzy-match t)
    (setq helm-mode-fuzzy-match t)
    (setq helm-buffer-max-length 40)
    (setq helm-locate-command "mdfind -name %s %s") ; Use spotlight for search
    (global-set-key (kbd "M-y") 'helm-show-kill-ring))
#+END_SRC

** [[https://github.com/magit/magit][magit/magit]]
Like git, for emacs. But cooler.

#+BEGIN_SRC emacs-lisp
  (use-package magit
    :ensure t)
#+END_SRC

** [[https://github.com/joaotavora/yasnippet][joaotavora/yasnippet]]
Freakin yasnippet. It's the best.

#+BEGIN_SRC emacs-lisp
  (use-package yasnippet
    ;; SNIPPETS!!!
    :ensure t
    :config
    (yas-global-mode 1))
#+END_SRC

** [[https://github.com/flycheck/flycheck][flycheck/flycheck]]
Syntax check for python. Pretty good.

#+BEGIN_SRC emacs-lisp
  (use-package flycheck
    ;; Pep8 check, basically
    :ensure t
    :config
    (global-set-key (kbd "<f11>") 'flycheck-mode))
#+END_SRC

** [[https://github.com/company-mode/company-mode][company-mode/company-mode]]
Supposedly better than autocomplete... Also  using
[[https://github.com/syohex/emacs-company-jedi][syohex/company-jedi]]

#+BEGIN_SRC emacs-lisp
  (use-package company
    :ensure t
    :config
    (add-hook 'after-init-hook 'global-company-mode)
    (use-package company-jedi
      ;; Not sure this is actually working for me
      :ensure t
      :config
      (defun my/python-mode-hook ()
        (add-to-list 'company-backends 'company-jedi))
      (add-hook 'python-mode-hook 'my/python-mode-hook)))
#+END_SRC

** [[https://github.com/Wilfred/ag.el][Wilfred/ag.el]]
Sweet package to integrate [[https://github.com/ggreer/the_silver_searcher][ag]] into emacs.

#+BEGIN_SRC emacs-lisp
  (use-package ag
    ;; Silver searcher
    :ensure t
    :defer t
    :init
    (use-package wgrep-ag  
      ;; Guess I need this first
      :ensure t
      :commands (wgrep-ag-setup))
    :config
    (add-hook 'ag-mode-hook
              (lambda ()
                (wgrep-ag-setup)
                (define-key ag-mode-map (kbd "n") 'evil-search-next)
                (define-key ag-mode-map (kbd "N") 'evil-search-previous)))
    (setq ag-executable "/usr/local/bin/ag")
    (setq ag-highlight-search t)
    (setq ag-reuse-buffers t)
    (setq ag-reuse-window t))
#+END_SRC

** [[https://github.com/alpaker/Fill-Column-Indicator][alpaker/Fill-Column-Indicator]]
I like a line length limit indicator in Python

#+BEGIN_SRC emacs-lisp

  (use-package fill-column-indicator
    :ensure t
    :init
    (setq-default fci-rule-column 79)
    (global-set-key (kbd "<f10>") 'fci-mode)
    (add-hook 'python-mode-hook 'fci-mode))
#+END_SRC

** [[https://github.com/Fanael/rainbow-delimiters][Fanael/rainbow-delimiters]]
Better parentheses coloring

#+BEGIN_SRC emacs-lisp
  (use-package rainbow-delimiters
    :ensure t
    :init
    (add-hook 'python-mode-hook 'rainbow-delimiters-mode)
    (add-hook 'emacs-lisp-mode-hook 'rainbow-delimiters-mode))
#+END_SRC

** [[https://github.com/tsdh/highlight-parentheses.el][tsdh/highlight-parentheses.el]]
Makes the parentheses my cursor is between stand out more.
 
#+BEGIN_SRC emacs-lisp
  (use-package highlight-parentheses
    ;; Make parenthesis I'm currently in stand out
    :ensure t)
#+END_SRC

** [[https://github.com/Fanael/highlight-numbers][Fanael/highlight-numbers]]
Neat-o

#+BEGIN_SRC emacs-lisp
  (use-package highlight-numbers
    :ensure t
    :init
    (add-hook 'python-mode-hook 'highlight-numbers-mode))
#+END_SRC

** [[https://github.com/vspinu/imenu-anywhere][vspinu/imenu-anywhere]]
imenu on steroids.

#+BEGIN_SRC emacs-lisp
  (use-package imenu-anywhere
    ;; Imenu on steroids
    :ensure t
    :config
    (global-set-key (kbd "<f5>") 'imenu-anywhere))
#+END_SRC

** [[https://github.com/TheBB/spaceline][TheBB/spaceline]]
I was looking for something with the nice look and simplicity of
[[https://github.com/itchyny/lightline.vim][this]]. Spaceline does ok. 

#+BEGIN_SRC emacs-lisp
  (use-package spaceline
    ;; Similar to vim's powerline, this one looks clean
    ;; and 'just works', to an extent
    :ensure t
    :config
    (require 'spaceline-config)
    (spaceline-spacemacs-theme)
    (spaceline-helm-mode)
    (spaceline-toggle-minor-modes-off)
    (spaceline-toggle-battery-on)
    (spaceline-toggle-buffer-size-off)
    (setq spaceline-highlight-face-func 'spaceline-highlight-face-evil-state)
    (set-face-background 'spaceline-evil-normal "#afd700")
    (set-face-foreground 'spaceline-evil-normal "#005f00")
    (set-face-background 'spaceline-evil-insert "#0087af")
    (set-face-foreground 'spaceline-evil-insert "white")
    (set-face-background 'spaceline-evil-visual "#ff8700")
    (set-face-foreground 'spaceline-evil-visual "#870000"))

#+END_SRC

** [[https://github.com/lunaryorn/fancy-battery.el][lunaryorn/fancy-battery.el]]
For nice battery display info.

#+BEGIN_SRC emacs-lisp
  (use-package fancy-battery
    ;; Something something battery
    :ensure t
    :config
    (fancy-battery-mode)
    (setq fancy-battery-show-percentage t)
    (fancy-battery-update))
#+END_SRC

