config/emacs.d/config.el
(use-package visual-fill-column
     :ensure t)
(require 'init-org)

(use-package helm
  :ensure t
  :init
  (require 'helm-config)
  :config
  (use-package helm-descbinds
    ;; To describe keys in a nicer way
    :ensure t)
  (use-package helm-projectile
    ;; To use with projectile
    :ensure t
    :config
    (projectile-global-mode))
  ;; (use-package helm-ag
  ;;    :ensure t)
  (helm-mode 1)
  (helm-autoresize-mode t)
  (global-set-key (kbd "M-x") 'helm-M-x)  
  (global-set-key (kbd "<f1>") 'helm-find-files)  
  (global-set-key (kbd "<f2>") 'helm-mini)
  (setq helm-completion-in-region-fuzzy-match t)
  (setq helm-mode-fuzzy-match t)
  (setq helm-buffer-max-length 40)
  (setq helm-locate-command "mdfind -name %s %s") ; Use spotlight for search
  (global-set-key (kbd "M-y") 'helm-show-kill-ring))

(use-package magit
  :ensure t)

(use-package yasnippet
  ;; SNIPPETS!!!
  :ensure t
  :config
  (yas-global-mode 1))

(use-package flycheck
  ;; Pep8 check, basically
  :ensure t
  :config
  (global-set-key (kbd "<f11>") 'flycheck-mode))

(use-package company
  :ensure t
  :config
  (add-hook 'after-init-hook 'global-company-mode)
  (use-package company-jedi
    ;; Not sure this is actually working for me
    :ensure t
    :config
    (defun my/python-mode-hook ()
      (add-to-list 'company-backends 'company-jedi))
    (add-hook 'python-mode-hook 'my/python-mode-hook)))

(use-package ag
  ;; Silver searcher
  :ensure t
  :defer t
  :init
  (use-package wgrep-ag  
    ;; Guess I need this first
    :ensure t
    :commands (wgrep-ag-setup))
  :config
  (add-hook 'ag-mode-hook
            (lambda ()
              (wgrep-ag-setup)
              (define-key ag-mode-map (kbd "n") 'evil-search-next)
              (define-key ag-mode-map (kbd "N") 'evil-search-previous)))
  (setq ag-executable "/usr/local/bin/ag")
  (setq ag-highlight-search t)
  (setq ag-reuse-buffers t)
  (setq ag-reuse-window t))

(use-package fill-column-indicator
  :ensure t
  :init
  (setq-default fci-rule-column 79)
  (global-set-key (kbd "<f10>") 'fci-mode)
  (add-hook 'python-mode-hook 'fci-mode))

(use-package rainbow-delimiters
  :ensure t
  :init
  (add-hook 'python-mode-hook 'rainbow-delimiters-mode)
  (add-hook 'emacs-lisp-mode-hook 'rainbow-delimiters-mode))

(use-package highlight-parentheses
  ;; Make parenthesis I'm currently in stand out
  :ensure t)

(use-package highlight-numbers
  :ensure t
  :init
  (add-hook 'python-mode-hook 'highlight-numbers-mode))

(use-package imenu-anywhere
  ;; Imenu on steroids
  :ensure t
  :config
  (global-set-key (kbd "<f5>") 'imenu-anywhere))

(use-package spaceline
  ;; Similar to vim's powerline, this one looks clean
  ;; and 'just works', to an extent
  :ensure t
  :config
  (require 'spaceline-config)
  (spaceline-spacemacs-theme)
  (spaceline-helm-mode)
  (spaceline-toggle-minor-modes-off)
  (spaceline-toggle-battery-on)
  (spaceline-toggle-buffer-size-off)
  (setq spaceline-highlight-face-func 'spaceline-highlight-face-evil-state)
  (set-face-background 'spaceline-evil-normal "#afd700")
  (set-face-foreground 'spaceline-evil-normal "#005f00")
  (set-face-background 'spaceline-evil-insert "#0087af")
  (set-face-foreground 'spaceline-evil-insert "white")
  (set-face-background 'spaceline-evil-visual "#ff8700")
  (set-face-foreground 'spaceline-evil-visual "#870000"))

(use-package fancy-battery
  ;; Something something battery
  :ensure t
  :config
  (fancy-battery-mode)
  (setq fancy-battery-show-percentage t)
  (fancy-battery-update))
