config/emacs.d/config.el

(use-package dictionary
  :ensure t)

(use-package sphinx-doc
  :ensure t
  :config
  (add-hook 'python-mode-hook
            (lambda ()
              (require 'sphinx-doc)
              (sphinx-doc-mode t))))

(use-package markdown-mode
  :ensure t)

(use-package markdown-preview-mode
  :ensure t)

(use-package csv-mode
  ;; I'll give this a shot
  :ensure t)

(use-package multi-term
  ;; Supposed to be nicer than ansi-term
  :ensure t)

;; (use-package smart-mode-powerline-theme
;;   :ensure t)

;; (use-package smart-mode-line
;;   :ensure t
;;   :config
;;   (setq sml/no-confirm-load-theme t)
;;   (setq sml/theme 'dark)
;;   (setq rm-whitelist '(""))
;;   (setq system-uses-terminfo nil)
;;   (sml/setup)
;;   (display-time-mode)
;;   (display-time-update)
;;   (fancy-battery-mode)
;;   (setq fancy-battery-show-percentage t))

;; (use-package elpy
;;   ;; Eh, I don't know...
;;   :ensure t
;;   :config
;;   (elpy-enable)
;;   (setq elpy-rpc-backend "jedi"))

;; (use-package yafolding
;;   ;; Man, good code folding is hard to come by in emacs
;;   ;; This one's ok, but there are a couple know issues that
;;   ;; don't quite make it worth it, I think.
;;   :ensure t
;;   :config
;;   (defun air--yafolding-kbd ()
;;  (local-set-key (kbd "C-c <up>") 'yafolding-hide-all)
;;  (local-set-key (kbd "C-c <down>") 'yafolding-show-all)
;;  (local-set-key (kbd "C-c <left>") 'yafolding-hide-element)
;;  (local-set-key (kbd "C-c <right>") 'yafolding-show-element)
;;  (local-set-key [C-tab] 'yafolding-toggle-element))
;;   (add-hook 'python-mode-hook 'yafolding-mode)
;;   (add-hook 'python-mode-hook 'air--yafolding-kbd))

;; (use-package jedi
;;   ;; Hasn't been working smoothly recently
;;   :ensure t
;;   :init
;;   (add-hook 'python-mode-hook 'jedi:setup)
;;   (setq jedi:complete-on-dot t))

;; (use-package auto-complete
;;   ;; Supposedly not as good as company mode
;;   :ensure t
;;   :config
;;   (global-auto-complete-mode t))

;; (use-package autopair
;;   :ensure t
;;   :config
;;   (autopair-global-mode))

(add-to-list 'auto-mode-alist '("\\.m$" . octave-mode))

;; Python stuff
(defun ipython ()
  (interactive)
  (ansi-term "/usr/local/bin/ipython"))
(defun ipython2()
  (interactive)
  (ansi-term "/Users/diego/.virtualenvs/py2/bin/ipython"))
(add-hook 'python-mode-hook 'highlight-parentheses-mode)
(add-hook 'python-mode-hook 'hs-minor-mode)
;;(add-hook 'python-mode-hook 'yafolding-mode)
(add-hook 'python-mode-hook 'yas-minor-mode)
(add-hook 'python-mode-hook
          (lambda () (set (make-local-variable 'comment-inline-offset) 2)))
(add-hook 'python-mode-hook (lambda () (setq tab-width 4)))
(add-hook 'python-mode-hook (lambda () (linum-mode 1)))
(setenv "PYTHONPATH" "/usr/local/bin/python3")

;; Emacs-lisp stuff
(defun my-lisp-mode-config ()
  (setq ac-sources '(ac-source-symbols ac-source-words-in-same-mode-buffers))
  (local-set-key (kbd "C-c <up>") 'hs-hide-all)
  (local-set-key (kbd "C-c <down>") 'hs-show-all)
  (local-set-key (kbd "C-c <left>") 'hs-hide-block)
  (local-set-key (kbd "C-c <right>") 'hs-show-block))

(add-hook 'emacs-lisp-mode-hook 'my-lisp-mode-config)
(add-hook 'emacs-lisp-mode-hook 'highlight-parentheses-mode)
(add-hook 'emacs-lisp-mode-hook 'hs-minor-mode)
(add-hook 'emacs-lisp-mode-hook (lambda () (linum-mode 1)))

;; Disable fci mode when autocomplete popup menu happens
(defun sanityinc/fci-enabled-p ()
    (and (boundp 'fci-mode) fci-mode))
(defvar sanityinc/fci-mode-suppressed nil)
(defadvice popup-create (before suppress-fci-mode activate)
  "Suspend fci-mode while popups are visible"
  (let ((fci-enabled (sanityinc/fci-enabled-p)))
    (when fci-enabled
      (set (make-local-variable 'sanityinc/fci-mode-suppressed) fci-enabled)
      (turn-off-fci-mode))))

(defadvice popup-delete (after restore-fci-mode activate)
  "Restore fci-mode when all popups have closed"
  (when (and sanityinc/fci-mode-suppressed
             (null popup-instances))
    (setq sanityinc/fci-mode-suppressed nil)
    (turn-on-fci-mode)))

(defface my-linum-hl
  `((t :inherit linum :background ,(face-background 'hl-line nil t)))
  "Face for the current line number."
  :group 'linum)

(defvar my-linum-format-string "%3d")

(add-hook 'linum-before-numbering-hook 'my-linum-get-format-string)

(defun my-linum-get-format-string ()
  (let* ((width (1+ (length (number-to-string
                             (count-lines (point-min) (point-max))))))
         (format (concat "%" (number-to-string width) "d ")))
    (setq my-linum-format-string format)))

(defvar my-linum-current-line-number 0)

(setq linum-format 'my-linum-format)

(defun my-linum-format (line-number)
  (propertize (format my-linum-format-string line-number) 'face
              (if (eq line-number my-linum-current-line-number)
                  'my-linum-hl
                'linum)))

(defadvice linum-update (around my-linum-update)
  (let ((my-linum-current-line-number (line-number-at-pos)))
    ad-do-it))
(ad-activate 'linum-update)
(add-hook 'term-mode-hook (lambda ()
                            (setq-local global-hl-line-mode
                                        nil)))
